In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('1991-92-clean.csv')
df1.drop(columns = ['Unnamed: 0'], inplace = True)

df2 = pd.read_csv('1992-93-clean.csv')
df2.drop(columns = ['Unnamed: 0'], inplace = True)

df3 = pd.read_csv('1993-94-clean.csv')
df3.drop(columns = ['Unnamed: 0'], inplace = True)

df4 = pd.read_csv('1995-96-clean.csv')
df4.drop(columns = ['Unnamed: 0'], inplace = True)

df5 = pd.read_csv('1996-97-clean.csv')
df5.drop(columns = ['Unnamed: 0'], inplace = True)

In [3]:
df1.columns

Index(['School Name', 'State',
       'State Abbr [Public School] Latest available year',
       'School ID - NCES Assigned [Public School] Latest available year',
       'County Name [Public School] 1991-92', 'Locale [Public School] 1991-92',
       'Total Students All Grades (Excludes AE) [Public School] 1991-92',
       'Free Lunch Eligible [Public School] 1991-92',
       'American Indian/Alaska Native Students [Public School] 1991-92',
       'Asian or Asian/Pacific Islander Students [Public School] 1991-92',
       'Hispanic Students [Public School] 1991-92',
       'Black or African American Students [Public School] 1991-92',
       'White Students [Public School] 1991-92',
       'Full-Time Equivalent (FTE) Teachers [Public School] 1991-92'],
      dtype='object')

In [4]:
df1.rename(columns = {
        'School Name' : "SCHOOL",
        'State': 'STATE',
       'State Abbr [Public School] Latest available year': 'ABBR',
       'School ID - NCES Assigned [Public School] Latest available year': 'ID',
       'County Name [Public School] 1991-92': 'COUNTY',
        'Locale [Public School] 1991-92': 'LOCALE',
       'Total Students All Grades (Excludes AE) [Public School] 1991-92' : 'TOTAL STUDENTS',
       'Free Lunch Eligible [Public School] 1991-92': 'FREE LUNCH ELIGIBLE',
       'American Indian/Alaska Native Students [Public School] 1991-92' : 'AMERICAN INDIAN',
       'Asian or Asian/Pacific Islander Students [Public School] 1991-92' : 'ASIAN',
       'Hispanic Students [Public School] 1991-92' : 'HISPANIC',
       'Black or African American Students [Public School] 1991-92': 'BLACK',
       'White Students [Public School] 1991-92': 'WHITE',
       'Full-Time Equivalent (FTE) Teachers [Public School] 1991-92': 'FTE TEACHERS'   
}, inplace = True)

In [5]:
df2.rename(columns = {
        'School Name' : "SCHOOL",
        'State Name [Public School] Latest available year': 'STATE',
       'State Abbr [Public School] Latest available year': 'ABBR',
       'School ID - NCES Assigned [Public School] Latest available year': 'ID',
       'County Name [Public School] 1992-93': 'COUNTY',
        'Locale [Public School] 1992-93': 'LOCALE',
       'Total Students All Grades (Excludes AE) [Public School] 1992-93' : 'TOTAL STUDENTS',
       'Free Lunch Eligible [Public School] 1992-93': 'FREE LUNCH ELIGIBLE',
       'American Indian/Alaska Native Students [Public School] 1992-93' : 'AMERICAN INDIAN',
       'Asian or Asian/Pacific Islander Students [Public School] 1992-93' : 'ASIAN',
       'Hispanic Students [Public School] 1992-93' : 'HISPANIC',
       'Black or African American Students [Public School] 1992-93': 'BLACK',
       'White Students [Public School] 1992-93': 'WHITE',
       'Full-Time Equivalent (FTE) Teachers [Public School] 1992-93': 'FTE TEACHERS'   
}, inplace = True)

In [6]:
df3.rename(columns = {
        'School Name' : "SCHOOL",
        'State Name [Public School] Latest available year': 'STATE',
       'State Abbr [Public School] Latest available year': 'ABBR',
       'School ID - NCES Assigned [Public School] Latest available year': 'ID',
       'County Name [Public School] 1993-94': 'COUNTY',
        'Locale [Public School] 1993-94': 'LOCALE',
       'Total Students All Grades (Excludes AE) [Public School] 1993-94' : 'TOTAL STUDENTS',
       'Free Lunch Eligible [Public School] 1993-94': 'FREE LUNCH ELIGIBLE',
       'American Indian/Alaska Native Students [Public School] 1993-94' : 'AMERICAN INDIAN',
       'Asian or Asian/Pacific Islander Students [Public School] 1993-94' : 'ASIAN',
       'Hispanic Students [Public School] 1993-94' : 'HISPANIC',
       'Black or African American Students [Public School] 1993-94': 'BLACK',
       'White Students [Public School] 1993-94': 'WHITE',
       'Full-Time Equivalent (FTE) Teachers [Public School] 1993-94': 'FTE TEACHERS'   
}, inplace = True)

In [7]:
df4.rename(columns = {
        'School Name' : "SCHOOL",
        'State Name [Public School] Latest available year': 'STATE',
       'State Abbr [Public School] Latest available year': 'ABBR',
       'School ID - NCES Assigned [Public School] Latest available year': 'ID',
       'County Name [Public School] 1995-96': 'COUNTY',
        'Locale [Public School] 1995-96': 'LOCALE',
       'Total Students All Grades (Excludes AE) [Public School] 1995-96' : 'TOTAL STUDENTS',
       'Free Lunch Eligible [Public School] 1995-96': 'FREE LUNCH ELIGIBLE',
       'American Indian/Alaska Native Students [Public School] 1995-96' : 'AMERICAN INDIAN',
       'Asian or Asian/Pacific Islander Students [Public School] 1995-96' : 'ASIAN',
       'Hispanic Students [Public School] 1995-96' : 'HISPANIC',
       'Black or African American Students [Public School] 1995-96': 'BLACK',
       'White Students [Public School] 1995-96': 'WHITE',
       'Full-Time Equivalent (FTE) Teachers [Public School] 1995-96': 'FTE TEACHERS'   
}, inplace = True)

In [8]:
df5.rename(columns = {
        'School Name' : "SCHOOL",
        'State Name [Public School] Latest available year': 'STATE',
       'State Abbr [Public School] Latest available year': 'ABBR',
       'School ID - NCES Assigned [Public School] Latest available year': 'ID',
       'County Name [Public School] 1996-97': 'COUNTY',
        'Locale [Public School] 1996-97': 'LOCALE',
       'Total Students All Grades (Excludes AE) [Public School] 1996-97' : 'TOTAL STUDENTS',
       'Free Lunch Eligible [Public School] 1996-97': 'FREE LUNCH ELIGIBLE',
       'American Indian/Alaska Native Students [Public School] 1996-97' : 'AMERICAN INDIAN',
       'Asian or Asian/Pacific Islander Students [Public School] 1996-97' : 'ASIAN',
       'Hispanic Students [Public School] 1996-97' : 'HISPANIC',
       'Black or African American Students [Public School] 1996-97': 'BLACK',
       'White Students [Public School] 1996-97': 'WHITE',
       'Full-Time Equivalent (FTE) Teachers [Public School] 1996-97': 'FTE TEACHERS'   
}, inplace = True)

In [9]:
df = pd.concat([df1, df2, df3, df4, df5], ignore_index = True)

In [10]:
df.shape

(429877, 14)

In [11]:
df.columns

Index(['SCHOOL', 'STATE', 'ABBR', 'ID', 'COUNTY', 'LOCALE', 'TOTAL STUDENTS',
       'FREE LUNCH ELIGIBLE', 'AMERICAN INDIAN', 'ASIAN', 'HISPANIC', 'BLACK',
       'WHITE', 'FTE TEACHERS'],
      dtype='object')

In [12]:
df.head()

,SCHOOL,STATE,ABBR,ID,COUNTY,LOCALE,TOTAL STUDENTS,FREE LUNCH ELIGIBLE,AMERICAN INDIAN,ASIAN,HISPANIC,BLACK,WHITE,FTE TEACHERS
0,1 SCHOOL ...,New York,NY,3.620000e+11,NASSAU,4-Urban fringe of midsize city,307,–,0,5,31,51,220,24.4
1,1ST WARD EL,Wisconsin,WI,5.500000e+11,CHIPPEWA,4-Urban fringe of midsize city,193,35,1,0,0,0,192,8.5
2,4-J ELEMENTARY SCHOOL,Wyoming,WY,5.600000e+11,CAMPBELL,6-Small town,48,4,0,0,0,0,48,4
3,5TH AND 6TH GRADE CTR.,Missouri,MO,2.930000e+11,SCOTT,6-Small town,731,271,0,1,4,176,550,38.5
4,6 SCHOOL,New York,NY,3.620000e+11,NASSAU,4-Urban fringe of midsize city,364,–,0,10,34,43,277,28.9

In [13]:
df.shape

(429877, 14)

In [14]:
## Delete all rows where free lunch eligible number is not known or where free lunch eligible is larger than total students

In [15]:
df['FREE LUNCH ELIGIBLE'] = df['FREE LUNCH ELIGIBLE'].apply( lambda x : x if (str(x)).isdigit() else None)

In [16]:
df['FREE LUNCH ELIGIBLE'].isna().sum()

117719

In [17]:
df[df['FREE LUNCH ELIGIBLE'].isna() == True].index

Int64Index([     0,      4,      6,     10,     14,     15,     16,     18,
                21,     27,
            ...
            429862, 429863, 429864, 429870, 429871, 429872, 429873, 429874,
            429875, 429876],
           dtype='int64', length=117719)

In [19]:
df.drop(df[df['FREE LUNCH ELIGIBLE'].isna() == True].index, inplace = True)

In [20]:
df.shape

(312158, 14)

Delete all rows where total students is not a digit

In [28]:
df['TOTAL STUDENTS'] = df['TOTAL STUDENTS'].apply( lambda x : x if str(x).isdigit() else None)

In [29]:
df['TOTAL STUDENTS'].isna().sum()

1859

In [30]:
df.drop(df[df['TOTAL STUDENTS'].isna() == True].index, inplace = True)

In [31]:
df.shape

(310299, 14)

In [32]:
##df.to_csv('feature-selection-91-96.csv')